Revit 2027 API
PrintSetup.InSession Property
The in-session Print Setting of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InSessionPrintSetting InSession { get; }
Public ReadOnly Property InSession As InSessionPrintSetting
	Get
public:
property InSessionPrintSetting^ InSession {
	InSessionPrintSetting^ get ();
}
member InSession : InSessionPrintSetting with get
Property Value
InSessionPrintSetting
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace